app/controllers/books_controller.rb

   def show
     @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 1)

   def create
    @book = Book.new(params[:book])
      if @book.save
---
INSERT INTO `books` (`price`, `created_at`, `title`, `updated_at`, `subject_id`, `description`) VALUES(200.0, '2010-12-27 09:35:52', 'Intrigral Calculas', '2010-12-27 09:35:52', 2, 'Author-S.K Mapa')

   def edit
     @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 1)

   def update
    @book = Book.find(params[:id])
      if @book.update_attributes(params[:book])
---
SELECT * FROM `books` WHERE (`books`.`id` = 3)
UPDATE `books` SET `updated_at` = '2010-12-27 09:58:37', `price` = 450.0 WHERE `id` = 3

   def delete
    Book.find(params[:id]).destroy
---
DELETE FROM `books` WHERE `id` = 10
SELECT * FROM `books` WHERE (`books`.`id` = 10)

   def show_subjects
      @subject = Subject.find(params[:id])
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)

   def buythisbook
      @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 7)