app/controllers/subjects_controller.rb

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
  def show
  @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`) VALUES('History')
---
  def create
  @subject = Subject.new(params[:subject])
      if @subject.save